Refactor documentation.
