--- a/src/architecture.md
+++ b/src/architecture.md
@@ -6,86 +6,55 @@ A typical ChirpStack deployment has the following architecture. Note that in
 this diagram, the gateways are connected in different ways to ChirpStack to
 highlight the different possible connectivity options.
 
-```dot process
-digraph G {
-	node [shape=record,fontsize="10"];
-	edge [fontsize="10"];
-	fontsize="10";
-
-	subgraph cluster_0 {
-		style=filled;
-		color="#bbdefb";
-		node [style=filled,color="#e3f2fd"];
-
-		"chirpstack" -> "pub-sub" [dir="both",label="MQTT"];
-		"chirpstack-gateway-bridge-cloud" -> "pub-sub" [dir="both" label="MQTT"];
-
-		"chirpstack" [label="ChirpStack"];
-		"pub-sub" [label="MQTT broker"];
-		"chirpstack-gateway-bridge-cloud" [label="ChirpStack Gateway Bridge"];
-
-		label = "Cloud / server / VM";
+```d2
+vars: {
+	d2-config: {
+		layout-engine: elk
 	}
-
-	subgraph cluster_1 {
-		style=filled;
-		color="#bbdefb";
-		node [style=filled,color="#e3f2fd"];
-		label="LoRa&reg; Gateway";
-
-		"chirpstack-mqtt-forwarder-gw1" -> "pub-sub" [label="MQTT",dir="both"];
-		"chirpstack-mqtt-forwarder-gw1" [label="UDP Packet Forwarder +\nChirpStack MQTT Forwarder"];
-	}
-
-	subgraph cluster_2 {
-		style=filled;
-		color="#bbdefb";
-		node [style=filled,color="#e3f2fd"];
-		label="LoRa&reg; Gateway";
-
-		"chirpstack-mqtt-forwarder-gw2" -> "pub-sub" [label="MQTT",dir="both"];
-		"chirpstack-mqtt-forwarder-gw2" [label="ChirpStack Concentratord +\nChirpStack MQTT Forwarder"];
-	}
-
-	subgraph cluster_3 {
-		style=filled;
-		color="#bbdefb";
-		node [style=filled,color="#e3f2fd"];
-		label="LoRa&reg; Gateway";
-
-		"packet-forwarder-gw2" -> "chirpstack-gateway-bridge-cloud" [label="UDP",dir="both"];
-		"packet-forwarder-gw2" [label="UDP Packet Forwarder"];
-	}
-
-	subgraph cluster_4 {
-		style=filled;
-		color="#bbdefb";
-		node [style=filled,color="#e3f2fd"];
-		label="LoRa&reg; Gateway";
-
-		"packet-forwarder-gw3" -> "chirpstack-gateway-bridge-cloud" [label="Websockets",dir="both"];
-		"packet-forwarder-gw3" [label="Basics Station"];
-	}
-
-	subgraph cluster_5 {
-		style=filled;
-		color="#bbdefb";
-		node [style=filled,color="#e3f2fd"];
-		label="Integrations";
-
-		"http-int" [label="HTTP"];
-		"mqtt-int" [label="MQTT"];
-		"other-int" [label="Etc ..."];
-	}
-
-
-	"chirpstack" -> "http-int";
-	"chirpstack" -> "mqtt-int";
-	"chirpstack" -> "other-int";
-
-	"as-api-client" -> "chirpstack" [label="gRPC"];
-	"as-api-client" [label="API client"];
 }
+
+vm: Cloud / VM
+lora_gateway_udp: LoRa Gateway
+lora_gateway_bs: LoRa Gateway
+lora_gateway_mqtt: LoRa Gateway
+integrations: Integrations
+api_client: API Client
+
+vm: {
+	chirpstack: ChirpStack
+	chirpstack_gateway_bridge: ChirpStack Gateway Bridge
+	mqtt_broker: MQTT Broker
+
+	chirpstack <> mqtt_broker
+	chirpstack_gateway_bridge <> mqtt_broker
+
+}
+
+lora_gateway_udp: {
+	udp_packet_forwarder: UDP Packet Forwarder
+}
+
+lora_gateway_bs: {
+	basics_station: Basics Station
+}
+
+lora_gateway_mqtt: {
+	chirpstack_mqtt_forwarder: ChirpStack MQTT Forwarder
+}
+
+integrations: {
+	http: HTTP
+	mqtt: MQTT
+	etc: Etc..
+}
+
+lora_gateway_udp.udp_packet_forwarder <> vm.chirpstack_gateway_bridge: UDP
+lora_gateway_bs.basics_station <> vm.chirpstack_gateway_bridge: Websockets
+lora_gateway_mqtt.chirpstack_mqtt_forwarder <> vm.mqtt_broker: MQTT
+vm.chirpstack -> integrations.http
+vm.chirpstack -> integrations.mqtt
+vm.chirpstack -> integrations.etc
+api_client -> vm.chirpstack: gRPC
 ```
 
 ## Multi-region example 1
